package datatype;

/**
 * @auther huangzhixue
 * @data 2021/8/4 10:04 上午
 * @Description
 * 关于各字节取值范围
 */
public class DataTypeTest {
    public static void main(String[] args) {
        byte b = 127;
        b += 1;
        System.out.println(b);
        // 结果为-128
        // 为啥？因为byte是8个字节，取值、范围为0111 1111=127 -- 1000 0000=-128
        // 揭秘：0111 1111+1=0111 1111+0000 0001=1000 0000=-128

        short s = Short.MAX_VALUE;
        s += 1;
        System.out.println(s);
        // 结果为-32768
        // 为啥？因为short是16个字节，取值范围为0111 1111 1111 1111=2^15-1=32767  --- 1000 0000 0000 0000=-32768
        // 揭秘：0111 1111 1111 1111+1=0111 1111 1111 1111+0000 0000 0000 0001=1000 0000 0000 0000=-32768
        // 经过上面的知识，可以知道
        // 1、int4个字节的取值===2^31-1 --- -2^31，即
        // 2、long8个字节的取值===2^63-1 --- -2^63
        // 那么浮点数呢？这里不研究～～

        // todo:ps- 二进制有符号位，0代表正数符合、1代表负数符号都不参与计算，但是因为0000 0000代表0，那么1000 0000不可能代表-0吧？所以就有1000 0000代表-128

    }
}
